[
  {
    "selector": ".group-header",
    "title": "Legend Grouping",
    "hint": "Groups help you organize your color-coding. <p>Forester automatically creates two groups for <i>classes</i> and <i>features</i>. Of course you can move elements freely within groups by dragging them around. Mixing of classes and features is also possible.</p><p>By clicking the <span><i class='fa fa-solid fa-eye-slash'></i></span> icon, you can hide a whole group. All elements in the group are then colored <span style='background:#ffffff'>white</span>.</p><p>You can add a new group by clicking the respective button at the bottom of the legend.</p>"
  },
  {
    "selector": ".entry",
    "title": "Legend Entries",
    "hint": "Each legend entry corresponds to one <i>class</i> or <i>feature</i>. To keep track, even when you move entries between groups, this is indicated by a small letter <code>C</code> or <code>F</code>.<p>You can change the color of an entry by clicking on the color indicator.</p><p>By clicking on the <code>M</code> icon, you can temporarily highlight one entry. It's color is changed to <span style='background:#ff0000'>red</span> while all other entries are shown in <span style='background:#ffffff'>white</span>.</p>"
  },
  {
    "selector": ".TextView",
    "title": "View: Node Summary",
    "hint": "This view summarizes the most relevant information for a node. <p>It displays the split feature and location (<b>Sp</b>), the sample number (<b>S</b>) and the class vote, as well as it's relative abundance (<b>V</b>). The names of features and classes are color-coded to make it easier to see patterns.</p><p>In the node settings, you can decide what information is shown or hidden.</p>"
  },
  {
    "selector": ".CCircleIconView",
    "title": "Node: Pie Charts",
    "hint": "This node visualization illustrates the class distribution at this node as a pie chart. For the sake of simplicity, only the five most abundand classes are shown. <p>Note, how class colors are related to the legend.</p>"
  },
  {
    "selector": "#group-new",
    "title": "Adding a Group",
    "hint": "By clicking the \"New group\" button, the user can add an empty group to the legend. A popup menu requests the groups name so make sure that you browser does not block Forester."
  },
  {
    "selector": ".settings-group[for='legend']",
    "title": "Default Colorscale for the Legend",
    "hint": "This option controls the legend's default colorscale. All scales from <a href='https://colorbrewer2.org/#type=sequential&scheme=BuGn&n=3' target='_blank'>ColorBrewer</a> can be selected.<p>When you open a new project in Forester, the scale <i>Pastel 2</i> is used. The assignment of the colors follows the initial order of the entries in the legend. The first two colors <span style='background:#b3e2cd'>#b3e2cd</span> and <span style='background:#fdcdac'>#fdcdac</span> are assigned to the first two entries and so on. When there are more entries than colors, they are colored <span style='background:#ffffff'>white</span>.</p>"
  },
  {
    "selector": ".settings-entry[for='layout.direction'], .settings-entry[for='layout.lspace'], .settings-entry[for='layout.bspace']",
    "title": "Layout Settings",
    "hint": "This section controls the layout algorithm that determines positions of the nodes within the tree. <p>The option <b>Layout Direction</b> determines the flow of the tree. The value may either be <span><i class='fa fa-solid fa-arrow-down'></i> top-bottom</span> for vertical or <span><i class='fa fa-solid fa-arrow-right'></i> left-right</span> for horizontal placement.</p><p>The two options <b>Level and Branch Space</b> determine the distance between levels and branches in the tree. Note, that these settings work in combination with the layout direction.</p>"
  },
  {
    "selector": ".settings-entry[for='layout.dendrogram']",
    "title": "Aligning Leaves at one Level",
    "hint": "By enabling the <b>Dendrogram</b> option, the layout algorithm aligns all leaves at the last level. This improves comparability between leaves and works very well in combination with the <i>Bar Chart Views</i>.<p>Note, that the dendrogram is much wider than the default layout. We advice to switch to square links between nodes.</p>"
  },
  {
    "selector": ".settings-group[for='path']",
    "title": "Link Style",
    "hint": "The option <b>Path style</b> controls the shape of links between nodes. The three values <i>linear</i>, <i>curved</i> and <i>ragged</i> use lines, sigmoidal curves and step functions respectively.<p>Information regarding the sample number and the class distribution can be encoded in the links. The option <b>Path Flow</b> can be used to encode the sample number in a link. When it is set to <i>linear</i> or <i>scaled</i> the link thickness encodes the number of samples that flow along a path. Based on the value, the number of samples is either scaled linearly or using a algorithm that homogenizes the sample number over many magnitudes. With the value <i>colorcoded</i>, the class distribution is additionally encoded within the link."
  },
  {
    "selector": ".settings-submit",
    "title": "Previewing and Saving Settings",
    "hint": "Most settings automatically trigger changes within the illustration. This preview is however not persistent. When you close the dialog, the settings are restored to their old values.<p>Only by clicking the submit button are settings permanently changed. Be careful, Forster is currently missing an <i>Undo</i> feature!</p>"
  },
  {
    "selector": ".lens",
    "title": "Node Context Menu",
    "hint": "Whenever you hover over a node, a context menu appears. Don't underestimate it! Although it is small it is very powerful.<p>By clicking the <span><i class='fa fa-solid fa-gear'></i> gear<span> you can open node-specific settings. They allow you to fine-tune a node's illustration. <br> Some views do not have changeable settings. For them, the icon is blocked: <i class='fa fa-solid fa-gear fa-shake' style='color:red'></i></p><p>With the <span><i class='fa fa-solid fa-arrow-left'></i> left<span> and <span><i class='fa fa-solid fa-arrow-right'></i> right<span> arrows, you can quickly scroll through all possible views for a node."
  },
  {
    "selector": ".settings-entry[for='applyTo']",
    "title": "Applying Settings for Multiple Nodes",
    "hint": "Using the <b>Apply To</b> option, you can update settings for multiple views at once.<ul style='padding-inline-start:20px'><li>With the value <i>this</i>, only the settings of the currently targeted node are updated.</li><li>With <i>subtree</i> this node and all it's children are updated.</li><li>With <i>view</i>, all nodes that currently use the same view are updated.</li><li><i>All</i> obviously updates all nodes of the tree.</li></ul><p>Note, that when settings for a view should be applied to a node that currently uses another view, that view is changed. This feature is not previewed and only takes effect when the changes are submitted."
  },
  {
    "selector": ".panzoom",
    "title": "Moving the Tree Around",
    "hint": "You can move the tree around freely by clicking and dragging with you mouse. It is not necessary to click on a node or link, any space in-between will do too.<p>Whenever you loose the tree, you can simply re-center it by double clicking on the free space. The tree is centered between all other visible elements, so that it does not lie partly behind hints, legend or settings.</p><p>Sometimes you want to take a closer look: By hovering over the tree and scrolling, you can zoom in and out. The zoom level is limited, so that you don't shrink it down too much.</p>"
  },
  {
    "selector": "#buttons",
    "title": "Interface Buttons",
    "hint": "This button opens and closes the global settings."
  }
]